uorweu/Tetris_on_esp32-c3-supermini/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"

# Console over native USB so GPIO20/21 are free as button inputs.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# 160 MHz + -O2, matching the host build for a fair RISC-vs-CISC comparison.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=160
CONFIG_COMPILER_OPTIMIZATION_PERF=y

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_LOG_DEFAULT_LEVEL_WARN=y
